package Ch09ClassBasic;

public class C01ClassInfo {

	public static void main(String[] args) {
		//1.객체
		//->현실 존재(독점적이고 배타적인 공간을 차지한다) 사물
		//->실존하는 객체의 처리를 위한 일부 정보를 추출하여(추상화) 프로그램의 메모리공간에 담아놓은 단위
		//-> == 인스턴스
		
		//2.객체의 구조
		//- 속성 : 객체를 표현하는 세부 데이터 단위
		//- 기능 : 객체가 구현할 수 있는 행위 단위
		
		//컴퓨터
		//- 속성 : 드라이브 RAM ROM CPU GPU 쿨러 디스크 OS
		//- 기능 : PowerOn/PowerOff, 앱 구동, 메모리 제어,연산, 서류작업, 연산 
		
		//3.클래스
		//객체에 필요한 공간생성과 기능을 제공하기 위해 미리 선언된 자료형
		//
		
		
	}

	

}
